/*
*********************************************************************************************************
*
*	模块名称 : 常用工具
*	文件名称 : tool.c
*	版    本 : V1.0
*	说    明 :
*
*   Copyright (C), 2019-2030, 武汉酷点机器人科技有限公司
*   淘宝店铺地址：https://shop559826635.taobao.com/
*********************************************************************************************************
*/
#include "includes.h"







/*********************************************************************************************************
*	函 数 名: XorCheck_Cal
*	功能说明: 异或校验计算。
*	形    参: _data 校验的数组的指针 _num 校验的起始位置 _len 校验的数据长度
*	返 回 值: _xorTemp 异或校验结果
*********************************************************************************************************
*/
uint8_t xorCheckCalc(uint8_t* _data, uint8_t _num, uint8_t _len)
{
    uint8_t _xorTemp = *(_data + _num);

    for(int i = _num + 1; i < _num + _len; i ++)
    {

        _xorTemp ^= (*(_data + i));
    }

    return _xorTemp ;
}


